
## Plan Result (shareable-lists-api-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/68305)


<pre><code>Plan: 2 to add, 2 to change, 0 to destroy.</code></pre>

* Create
  * aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4
  * local_file.application_ecs_service_appspec_94386B9C
* Update
  * aws_rds_cluster.rds_rds_cluster_1A0399FD
  * aws_rds_cluster_instance.rds_rds-instance_6675FA88


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_ecs_task_definition.application_ecs_service_ecs-task_461CC9D4 will be created
  + resource "aws_ecs_task_definition" "application_ecs_service_ecs-task_461CC9D4" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = jsonencode(
            [
              + {
                  + cpu                    = 0
                  + environment            = [
                      + {
                          + name  = "ENVIRONMENT"
                          + value = "production"
                        },
                      + {
                          + name  = "EVENT_BUS_NAME"
                          + value = "PocketEventBridge-Prod-Shared-Event-Bus"
                        },
                      + {
                          + name  = "NODE_ENV"
                          + value = "production"
                        },
                      + {
                          + name  = "REDIS_IS_CLUSTER"
                          + value = "true"
                        },
                      + {
                          + name  = "REDIS_IS_TLS"
                          + value = "true"
                        },
                      + {
                          + name  = "REDIS_PRIMARY_ENDPOINT"
                          + value = "shareablelistsapi-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                      + {
                          + name  = "REDIS_READER_ENDPOINT"
                          + value = "shareablelistsapi-prod-serverless-zcx42u.serverless.use1.cache.amazonaws.com"
                        },
                    ]
                  + essential              = true
                  + healthCheck            = {
                      + command     = [
                          + "CMD-SHELL",
                          + "curl -f http://localhost:4029/.well-known/apollo/server-health || exit 1",
                        ]
                      + interval    = 15
                      + retries     = 3
                      + startPeriod = 0
                      + timeout     = 5
                    }
                  + image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/shareablelistsapi-prod-app:8119445894f18ba099b1ca96b108e24feb7e89db"
                  + logConfiguration       = {
                      + logDriver     = "awslogs"
                      + options       = {
                          + awslogs-group             = "/Backend/ShareableListsApi-Prod/ecs/app"
                          + awslogs-multiline-pattern = "^\\S.+"
                          + awslogs-region            = "us-east-1"
                          + awslogs-stream-prefix     = "ecs"
                        }
                      + secretOptions = []
                    }
                  + mountPoints            = []
                  + name                   = "app"
                  + portMappings           = [
                      + {
                          + containerPort = 4029
                          + hostPort      = 4029
                        },
                    ]
                  + readonlyRootFilesystem = false
                  + secrets                = [
                      + {
                          + name      = "DATABASE_HOST"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:host::"
                        },
                      + {
                          + name      = "DATABASE_NAME"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:dbname::"
                        },
                      + {
                          + name      = "DATABASE_PASSWORD"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:password::"
                        },
                      + {
                          + name      = "DATABASE_PORT"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:port::"
                        },
                      + {
                          + name      = "DATABASE_URL"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:database_url::"
                        },
                      + {
                          + name      = "DATABASE_USER"
                          + valueFrom = "arn:aws:secretsmanager:us-east-1:996905175585:secret:ShareableListsApi-Prod/shareablelistsapi-prod20230207160218618400000003-d1m38d:username::"
                        },
                      + {
                          + name      = "SENTRY_DSN"
                          + valueFrom = "arn:aws:ssm:us-east-1:996905175585:parameter/ShareableListsApi/Prod/SENTRY_DSN"
                        },
                    ]
                  + volumesFrom            = []
                },
            ]
        )
      + cpu                      = "512"
      + execution_role_arn       = "arn:aws:iam::996905175585:role/ShareableListsApi-Prod-TaskExecutionRole"
      + family                   = "ShareableListsApi-Prod"
      + id                       = (known after apply)
      + memory                   = "2048"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = true
      + tags                     = {
          + "environment" = "Prod"
          + "service"     = "ShareableListsApi"
        }
      + tags_all                 = {
          + "environment" = "Prod"
          + "service"     = "ShareableListsApi"
        }
      + task_role_arn            = "arn:aws:iam::996905175585:role/ShareableListsApi-Prod-TaskRole"
      + track_latest             = false
    }

  # aws_rds_cluster.rds_rds_cluster_1A0399FD will be updated in-place
  ~ resource "aws_rds_cluster" "rds_rds_cluster_1A0399FD" {
      ~ engine_version                      = "8.0.mysql_aurora.3.05.2" -> "8.0.mysql_aurora.3.05.1"
        id                                  = "shareablelistsapi-prod20230207160218618400000003"
        tags                                = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (39 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_rds_cluster_instance.rds_rds-instance_6675FA88 will be updated in-place
  ~ resource "aws_rds_cluster_instance" "rds_rds-instance_6675FA88" {
      ~ engine_version                        = "8.0.mysql_aurora.3.05.2" -> "8.0.mysql_aurora.3.05.1"
        id                                    = "shareablelistsapi-prod20230207160218618400000003-serverless"
        tags                                  = {}
        # (27 unchanged attributes hidden)
    }

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_rds_cluster.rds_rds_cluster_1A0399FD has changed
  ~ resource "aws_rds_cluster" "rds_rds_cluster_1A0399FD" {
      ~ engine_version                      = "8.0.mysql_aurora.3.05.1" -> "8.0.mysql_aurora.3.05.2"
        id                                  = "shareablelistsapi-prod20230207160218618400000003"
        tags                                = {
            "environment" = "Prod"
            "service"     = "ShareableListsApi"
        }
        # (39 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobID":"4cb89808-7184-4a98-a40d-7eb3c40e4460","JobName":"shareable-lists-api_infrastructure_plan_prod","PRNumber":240,"Program":"tfcmt","SHA1":"8119445894f18ba099b1ca96b108e24feb7e89db","Target":"shareable-lists-api-cdk","Vars":{}} -->